app/Controllers/DaftarMenu.php

    public function index()
    {

        $modelDaftarMenu = new ModelDaftarMenu();

        $data = [
            'menu'          => 'setting',
            'submenu'       => 'daftarmenu',
            'viewdata'      => $modelDaftarMenu->findAll(),
---
SELECT *
FROM `daftarmenu`

    public function uploadgambar($id)
    {

        $modelDaftarMenu = new ModelDaftarMenu();
        $dataMenu = $modelDaftarMenu->find($id);
---
SELECT *
FROM `daftarmenu`
WHERE `daftarmenu`.`menuid` = '23'

    public function simpangambar()
    {

        $menuid         = $this->request->getPost('menuid');
        $menufoto       = $this->request->getFile('menufoto');

        $modelDaftarMenu = new ModelDaftarMenu();

        // update Foto
        if ($menufoto == "") {
            $fileGambarFoto = $menufoto->getRandomName();
        } else {
            $fileGambarFoto = $menufoto->getRandomName();

            $menufoto->move('upload', $fileGambarFoto);
        }

        $dataFoto = $modelDaftarMenu->find($menuid);

        if ($dataFoto['menufoto'] == "") {
        } else {
            unlink('upload/' . $dataFoto['menufoto']);
        }



        $modelDaftarMenu->update($menuid, [
            'menufoto'        => $fileGambarFoto,
        ]);


        $data = [
            'menu'          => 'setting',
            'submenu'       => 'daftarmenu',
            'viewdata'      => $modelDaftarMenu->findAll(),
        ];
---
SELECT *
FROM `daftarmenu`
WHERE `daftarmenu`.`menuid` = '16'
UPDATE `daftarmenu` SET `menufoto` = '1695109588_d2dbdef08ed6d15672c5.jpeg'
WHERE `daftarmenu`.`menuid` IN ('16')
SELECT *
FROM `daftarmenu`