app/Controllers/Penilaian.php

    public function index()
    {

        $modelPenilaian = new ModelDaftarMenu();

        $data = [
            'menu'          => 'penilaian',
            'submenu'       => 'nilai',
            'viewdata'      => $modelPenilaian->findAll(),
---
SELECT *
FROM `daftarmenu`

    public function formedit($id)
    {

        $modelBobot = new ModelBobot();

        $modelPenilaian = new ModelDaftarMenu();
        $dataNilai = $modelPenilaian->find($id);

        $data = [
            'menu'              => 'setting',
            'submenu'           => 'kriteria',
            'menuid'            => $dataNilai['menuid'],
            'menunama'          => $dataNilai['menunama'],
            'menuharga'         => $dataNilai['menuharga'],
            'n_harga'           => $dataNilai['n_harga'],
            'n_rasa'            => $dataNilai['n_rasa'],
            'n_kebersihan'      => $dataNilai['n_kebersihan'],
            'n_pelayanan'       => $dataNilai['n_pelayanan'],
            'databobot'         => $modelBobot->findAll(),
---
SELECT *
FROM `daftarmenu`
WHERE `daftarmenu`.`menuid` = '1'
SELECT *
FROM `bobot`