app/Controllers/User.php

SELECT *
FROM `user`
---
    public function index()
    {
        $modelUser = new ModelLogin();

        $data = [
            'menu'          => 'setting',
            'submenu'       => 'user',
            'viewdata'      => $modelUser->findAll(),
        ];