app/Models/ModelDaftarMenu.php

    public function Food($food)
    {
        return $this->table('daftarmenu')->orderBy('totalnilai', 'DESC')->getWhere([
            'menukategori' => $food
        ]);
---
SELECT *
FROM `daftarmenu`
WHERE `menukategori` = 'Food'
ORDER BY `totalnilai` DESC

    public function Beverages($beverages)
    {
        return $this->table('daftarmenu')->orderBy('totalnilai', 'DESC')->getWhere([
            'menukategori' => $beverages
        ]);
---
SELECT *
FROM `daftarmenu`
WHERE `menukategori` = 'Beverages'
ORDER BY `totalnilai` DESC