app/Models/ModelDaftarMenu.php

    public function Food($food)
    {
        return $this->table('daftarmenu')->getWhere([
            'menukategori' => $food
        ]);
---
SELECT *
FROM `daftarmenu`
WHERE `menukategori` = 'Food'

    public function Beverages($beverages)
    {
        return $this->table('daftarmenu')->getWhere([
            'menukategori' => $beverages
        ]);
---
SELECT *
FROM `daftarmenu`
WHERE `menukategori` = 'Beverages'