app/Models/ModelKriteria.php

    public function TampilKriteria()
    {
        return $this->table('kriteria')->join('bobot', 'bobotid=bobot', 'left')->get();
---
SELECT *
FROM `kriteria`
LEFT JOIN `bobot` ON `bobotid`=`bobot`